# upgrade brew
tap "homebrew/bundle"

# specify arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# brew 'install'
brew 'git'
brew 'gh'
brew 'neovim'
brew 'python'
brew 'trash'
brew 'tmux'

# brew install '--cask'
cask "arc"
cask "hacker-nerd-font"
cask "gimp"
cask "jordanbaird-ice"
cask "nightfall"
cask "raycast"
cask "sf-symbols"
cask "zotero"
cask "docker"
cask "font-sf-pro"
cask "iterm2"
cask "karabiner-elements"
cask "obsidian"
cask "rectangle"
cask "superlist"
cask "visual-studio-code"
cask "notion"
cask "notion-calendar"
